#+TITLE: N3MO'S EMACS CONFIG 
#+AUTHOR: n3mo
#+DESCRIPTION: my personal emacs config, very much a WIP
#+STARTUP: showeverything
#+OPTIONS: toc:2

** HIGHLIGHT INDENT GUIDES
#+begin_src emacs-lisp
  (use-package highlight-indent-guides
               :ensure t
               :config
               (setq highlight-indent-guides-method 'character
                     highlight-indent-guides-character ?|))
               ;(set-face-background 'highlight-indent-guides-odd-face "darkgray")
               ;(set-face-background 'highlight-indent-guides-even-face "dimgray"))

  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)

  (add-hook 'org-mode-hook 'highlight-indent-guides-mode)
#+end_src

#+RESULTS:
| highlight-indent-guides-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (org-bullets-mode 1)) | org-indent-mode | toc-org-enable | display-line-numbers-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |
